{
  "_attn_implementation_autoset": true,
  "_name_or_path": "google/siglip2-base-patch16-256",
  "initializer_factor": 1.0,
  "model_type": "siglip",
  "text_config": {
    "model_type": "siglip_text_model",
    "torch_dtype": "float32",
    "vocab_size": 256000
  },
  "torch_dtype": "float32",
  "transformers_version": "4.50.0.dev0",
  "vision_config": {
    "image_size": 256,
    "model_type": "siglip_vision_model",
    "torch_dtype": "float32"
  }
}
